# SQL

In [1]:
import polars as pl

In [2]:
employees = [
    {
        'EmployeeID': 1,
        'FirstName': 'John',
        'LastName': 'Doe',
        'Salary': 60000.0,
        'HireDate': '2020-01-15',
        'ExitDate': None,
        'DepartmentID': 1,
        'PhoneNumber': '123-456-7890',
        'Email': 'john.doe@example.com',
        'ManagerID': None
    },
    {
        'EmployeeID': 2,
        'FirstName': '  Jane',
        'LastName': 'Smith',
        'Salary': 75000.0,
        'HireDate': '2018-07-01',
        'ExitDate': None,
        'DepartmentID': 2,
        'PhoneNumber': '789-456-7890',
        'Email': 'jane.smith@example.com',
        'ManagerID': 1
    },
    {
        'EmployeeID': 3,
        'FirstName': ' Alice ',
        'LastName': 'Johnson',
        'Salary': 50000.0,
        'HireDate': '2021-01-01',
        'ExitDate': None,
        'DepartmentID': 1,
        'PhoneNumber': '345-456-7890',
        'Email': 'alice.johnson@example.com',
        'ManagerID': 1
    },
    {
        'EmployeeID': 4,
        'FirstName': 'Bob',
        'LastName': 'Brown',
        'Salary': 45000.0,
        'HireDate': '2019-11-15',
        'ExitDate': '2023-01-01',
        'DepartmentID': 3,
        'PhoneNumber': '987-456-7890',
        'Email': 'bob.brown@example.com',
        'ManagerID': 2
    },
    {
        'EmployeeID': 5,
        'FirstName': 'Charlie',
        'LastName': 'Davis',
        'Salary': 80000.0,
        'HireDate': '2016-01-15',
        'ExitDate': None,
        'DepartmentID': 2,
        'PhoneNumber': '321-456-7890',
        'Email': 'charlie.davis@example.com',
        'ManagerID': None
    },
    {
        'EmployeeID': 6,
        'FirstName': 'Eve',
        'LastName': 'Wilson',
        'Salary': 90000.0,
        'HireDate': '2020-07-15',
        'ExitDate': None,
        'DepartmentID': 3,
        'PhoneNumber': '147-456-7890',
        'Email': 'eve.wilson@example.com',
        'ManagerID': 2
    },
    {
        'EmployeeID': 7,
        'FirstName': 'Frank',
        'LastName': 'Taylor',
        'Salary': 55000.0,
        'HireDate': '2022-10-01',
        'ExitDate': None,
        'DepartmentID': 1,
        'PhoneNumber': '945-456-7890',
        'Email': None,
        'ManagerID': 3
    },
    {
        'EmployeeID': 8,
        'FirstName': 'Dan',
        'LastName': 'Smith',
        'Salary': 55000.0,
        'HireDate': '2020-11-15',
        'ExitDate': None,
        'DepartmentID': 5,
        'PhoneNumber': None,
        'Email': None,
        'ManagerID': None
    },
]

departments = [
    {
        'DepartmentID': 1,
        'DepartmentName': "HR",
        'Location': 'New York'
    },
    {
        'DepartmentID': 2,
        'DepartmentName': "Engineering",
        'Location': 'San Francisco'
    },
    {
        'DepartmentID': 3,
        'DepartmentName': "Finance",
        'Location': 'Chicago'
    },
    {
        'DepartmentID': 4,
        'DepartmentName': "IT",
        'Location': 'Denver'
    },
]

state_log = [
    {
        'StateID': 1,
        'EntityID': 1,
        'State': 'Created',
        'TransitionTime': '2023-01-01 10:00:00'
    },
    {
        'StateID': 2,
        'EntityID': 1,
        'State': 'Processing',
        'TransitionTime': '2023-01-01 12:00:00'
    },
    {
        'StateID': 3,
        'EntityID': 1,
        'State': 'Completed',
        'TransitionTime': '2023-01-01 15:00:00'
    },
    {
        'StateID': 4,
        'EntityID': 2,
        'State': 'Created',
        'TransitionTime': '2023-01-02 09:00:00'
    },
    {
        'StateID': 5,
        'EntityID': 2,
        'State': 'Processing',
        'TransitionTime': '2023-01-02 11:00:00'
    },
    {
        'StateID': 6,
        'EntityID': 2,
        'State': 'Failed',
        'TransitionTime': '2023-01-02 14:00:00'
    },
]

In [3]:
emp = pl.DataFrame(employees)

dep = pl.DataFrame(departments)

state = pl.DataFrame(state_log)

## Basic SQL Queries

### SELECT

Retrieve data from database

In [4]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    """
).collect()

shape: (8, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ 1          ┆ 123-456-7 ┆ john.doe@ ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ example.c ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ om        ┆           │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 2          ┆ 789-456-7 ┆ jane.smit ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ h@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1          ┆ 345-456-7 ┆ alice.joh ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ nson@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 3          ┆ 987-456-7 ┆ bob.brown ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ @example. ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ com       ┆           │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ 2          ┆ 321-456-7 ┆ charlie.d ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ avis@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 3          ┆ 147-456-7 ┆ eve.wilso ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ n@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 1          ┆ 945-456-7 ┆ null      ┆ 3         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆           ┆           │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ 5          ┆ null      ┆ null      ┆ null      │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### WHERE

Filter records based on conditions

In [5]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        Salary > 50000
    """
).collect()

shape: (6, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ 1          ┆ 123-456-7 ┆ john.doe@ ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ example.c ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ om        ┆           │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 2          ┆ 789-456-7 ┆ jane.smit ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ h@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ 2          ┆ 321-456-7 ┆ charlie.d ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ avis@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 3          ┆ 147-456-7 ┆ eve.wilso ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ n@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 1          ┆ 945-456-7 ┆ null      ┆ 3         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆           ┆           │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ 5          ┆ null      ┆ null      ┆ null      │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### AND/OR

Filter records based on more than one condition

In [6]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        (Salary > 50000 AND DepartmentID = 1) OR (LastName = 'Davis')
    """
).collect()

shape: (3, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ 1          ┆ 123-456-7 ┆ john.doe@ ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ example.c ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ om        ┆           │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ 2          ┆ 321-456-7 ┆ charlie.d ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ avis@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 1          ┆ 945-456-7 ┆ null      ┆ 3         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆           ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### ORDER BY

Sort the result set in ascending or descending order

In [7]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    ORDER BY
        Salary DESC
    """
).collect()

shape: (8, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 3          ┆ 147-456-7 ┆ eve.wilso ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ n@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ 2          ┆ 321-456-7 ┆ charlie.d ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ avis@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 2          ┆ 789-456-7 ┆ jane.smit ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ h@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ 1          ┆ 123-456-7 ┆ john.doe@ ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ example.c ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ om        ┆           │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 1          ┆ 945-456-7 ┆ null      ┆ 3         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆           ┆           │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ 5          ┆ null      ┆ null      ┆ null      │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1          ┆ 345-456-7 ┆ alice.joh ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ nson@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 3          ┆ 987-456-7 ┆ bob.brown ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ @example. ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ com       ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### LIMIT/FETCH/TOP

Limit the number of rows returned

In [8]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    ORDER BY
        Salary DESC
    LIMIT
        1
    """
).collect()

shape: (1, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 3          ┆ 147-456-7 ┆ eve.wilso ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ n@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

## Aggregation Functions

### COUNT

Count the number of rows

In [9]:
pl.sql(
    """
    SELECT
        COUNT(*) AS RowCount
    FROM
        emp
    """
).collect()

shape: (1, 1)
┌──────────┐
│ RowCount │
│ ---      │
│ u32      │
╞══════════╡
│ 8        │
└──────────┘

### SUM

Calculate the sum of a numeric column

In [10]:
pl.sql(
    """
    SELECT
        SUM(Salary) AS Payroll
    FROM
        emp
    """
).collect()

shape: (1, 1)
┌──────────┐
│ Payroll  │
│ ---      │
│ f64      │
╞══════════╡
│ 510000.0 │
└──────────┘

### Average

Calculate the average of a numeric column

In [11]:
pl.sql(
    """
    SELECT
        AVG(Salary) AS AverageSalary
    FROM
        emp
    """
).collect()

shape: (1, 1)
┌───────────────┐
│ AverageSalary │
│ ---           │
│ f64           │
╞═══════════════╡
│ 63750.0       │
└───────────────┘

### MIN/MAX

Find the minimum or maximum value in a column

In [12]:
pl.sql(
    """
    SELECT
        MIN(Salary) AS MinSalary,
        MAX(Salary) AS MaxSalary
    FROM
        emp
    """
).collect()

shape: (1, 2)
┌───────────┬───────────┐
│ MinSalary ┆ MaxSalary │
│ ---       ┆ ---       │
│ f64       ┆ f64       │
╞═══════════╪═══════════╡
│ 45000.0   ┆ 90000.0   │
└───────────┴───────────┘

### GROUP BY

Group rows to apply aggregate functions

In [13]:
pl.sql(
    """
    SELECT
        DepartmentID,
        AVG(Salary) AS AvgSalaryPerDept
    FROM
        emp
    GROUP BY
        DepartmentID
    """
).collect()

shape: (4, 2)
┌──────────────┬──────────────────┐
│ DepartmentID ┆ AvgSalaryPerDept │
│ ---          ┆ ---              │
│ i64          ┆ f64              │
╞══════════════╪══════════════════╡
│ 3            ┆ 67500.0          │
│ 2            ┆ 77500.0          │
│ 5            ┆ 55000.0          │
│ 1            ┆ 55000.0          │
└──────────────┴──────────────────┘

### HAVING

Filter groups based on aggregate conditions

In [14]:
pl.sql(
    """
    SELECT
        DepartmentID,
        AVG(Salary) AS AvgSalaryPerDept
    FROM
        emp
    GROUP BY
        DepartmentID
    HAVING
        AvgSalaryPerDept > 70000
    """
).collect()

shape: (1, 2)
┌──────────────┬──────────────────┐
│ DepartmentID ┆ AvgSalaryPerDept │
│ ---          ┆ ---              │
│ i64          ┆ f64              │
╞══════════════╪══════════════════╡
│ 2            ┆ 77500.0          │
└──────────────┴──────────────────┘

## Joining Tables

### INNER JOIN

Combine rows from two tables where there is a match

In [15]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    INNER JOIN dep ON dep.DepartmentID = emp.DepartmentID
    """
).collect()

shape: (7, 13)
┌────────────┬───────────┬──────────┬─────────┬───┬───────────┬────────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ ManagerID ┆ Department ┆ Departmen ┆ Location  │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ---       ┆ ID:dep     ┆ tName     ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ i64       ┆ ---        ┆ ---       ┆ str       │
│            ┆           ┆          ┆         ┆   ┆           ┆ i64        ┆ str       ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪═══════════╪════════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ null      ┆ 1          ┆ HR        ┆ New York  │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 1         ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1         ┆ 1          ┆ HR        ┆ New York  │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ null      ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 3         ┆ 1          ┆ HR        ┆ New York  │
└────────────┴───────────┴──────────┴─────────┴───┴───────────┴────────────┴───────────┴───────────┘

### LEFT JOIN

Include all rows from the left table, even if there's no match in the right table

In [16]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    LEFT JOIN dep ON dep.DepartmentID = emp.DepartmentID
    """
).collect()

shape: (8, 13)
┌────────────┬───────────┬──────────┬─────────┬───┬───────────┬────────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ ManagerID ┆ Department ┆ Departmen ┆ Location  │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ---       ┆ ID:dep     ┆ tName     ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ i64       ┆ ---        ┆ ---       ┆ str       │
│            ┆           ┆          ┆         ┆   ┆           ┆ i64        ┆ str       ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪═══════════╪════════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ null      ┆ 1          ┆ HR        ┆ New York  │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 1         ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1         ┆ 1          ┆ HR        ┆ New York  │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ null      ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 3         ┆ 1          ┆ HR        ┆ New York  │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ null      ┆ null       ┆ null      ┆ null      │
└────────────┴───────────┴──────────┴─────────┴───┴───────────┴────────────┴───────────┴───────────┘

### RIGHT JOIN

Include all rows from the right table, even if there's no match in the left table

In [17]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    RIGHT JOIN dep ON dep.DepartmentID = emp.DepartmentID
    """
).collect()

shape: (8, 13)
┌────────────┬───────────┬──────────┬─────────┬───┬───────────┬────────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ ManagerID ┆ Department ┆ Departmen ┆ Location  │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ---       ┆ ID:dep     ┆ tName     ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ i64       ┆ ---        ┆ ---       ┆ str       │
│            ┆           ┆          ┆         ┆   ┆           ┆ i64        ┆ str       ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪═══════════╪════════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ null      ┆ 1          ┆ HR        ┆ New York  │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1         ┆ 1          ┆ HR        ┆ New York  │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 3         ┆ 1          ┆ HR        ┆ New York  │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 1         ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ null      ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ null       ┆ null      ┆ null     ┆ null    ┆ … ┆ null      ┆ 4          ┆ IT        ┆ Denver    │
└────────────┴───────────┴──────────┴─────────┴───┴───────────┴────────────┴───────────┴───────────┘

### FULL OUTER JOIN

Include all rows when there is a match in either table

In [18]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    FULL OUTER JOIN dep ON dep.DepartmentID = emp.DepartmentID
    """
).collect()

shape: (9, 13)
┌────────────┬───────────┬──────────┬─────────┬───┬───────────┬────────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ ManagerID ┆ Department ┆ Departmen ┆ Location  │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ---       ┆ ID:dep     ┆ tName     ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ i64       ┆ ---        ┆ ---       ┆ str       │
│            ┆           ┆          ┆         ┆   ┆           ┆ i64        ┆ str       ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪═══════════╪════════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ null      ┆ 1          ┆ HR        ┆ New York  │
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 1         ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 3          ┆  Alice    ┆ Johnson  ┆ 50000.0 ┆ … ┆ 1         ┆ 1          ┆ HR        ┆ New York  │
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ null      ┆ 2          ┆ Engineeri ┆ San       │
│            ┆           ┆          ┆         ┆   ┆           ┆            ┆ ng        ┆ Francisco │
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 2         ┆ 3          ┆ Finance   ┆ Chicago   │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 3         ┆ 1          ┆ HR        ┆ New York  │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ null      ┆ null       ┆ null      ┆ null      │
│ null       ┆ null      ┆ null     ┆ null    ┆ … ┆ null      ┆ 4          ┆ IT        ┆ Denver    │
└────────────┴───────────┴──────────┴─────────┴───┴───────────┴────────────┴───────────┴───────────┘

## String Functions

### LIKE

Allows for pattern matching on string columns

- "%" - Matches zero or more characters
- "_" - Matches exactly one character

In [19]:
# Find all rows where the column starts with 'E'

pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        FirstName LIKE 'E%'
    """
).collect()

shape: (1, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 6          ┆ Eve       ┆ Wilson   ┆ 90000.0 ┆ … ┆ 3          ┆ 147-456-7 ┆ eve.wilso ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ n@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

In [20]:
# Find all rows where the column ends with 'n'

pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        FirstName LIKE '%n'
    """
).collect()

shape: (2, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 1          ┆ John      ┆ Doe      ┆ 60000.0 ┆ … ┆ 1          ┆ 123-456-7 ┆ john.doe@ ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ example.c ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ om        ┆           │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ 5          ┆ null      ┆ null      ┆ null      │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

In [21]:
# Find all rows where the column contains 'an'

pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        FirstName LIKE '%an%'
    """
).collect()

shape: (3, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 2          ┆   Jane    ┆ Smith    ┆ 75000.0 ┆ … ┆ 2          ┆ 789-456-7 ┆ jane.smit ┆ 1         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ h@example ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ .com      ┆           │
│ 7          ┆ Frank     ┆ Taylor   ┆ 55000.0 ┆ … ┆ 1          ┆ 945-456-7 ┆ null      ┆ 3         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆           ┆           │
│ 8          ┆ Dan       ┆ Smith    ┆ 55000.0 ┆ … ┆ 5          ┆ null      ┆ null      ┆ null      │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

In [22]:
# Find all rows where the column has 'h' as the second character

pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        FirstName LIKE '_h%'
    """
).collect()

shape: (1, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 5          ┆ Charlie   ┆ Davis    ┆ 80000.0 ┆ … ┆ 2          ┆ 321-456-7 ┆ charlie.d ┆ null      │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ avis@exam ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ ple.com   ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### UPPER/LOWER

Convert strings to uppercase or lowercase

In [23]:
pl.sql(
    """
    SELECT
        LOWER(FirstName) AS LowerFirstName,
        UPPER(FirstName) AS UpperFirstName
    FROM
        emp
    """
).collect()

shape: (8, 2)
┌────────────────┬────────────────┐
│ LowerFirstName ┆ UpperFirstName │
│ ---            ┆ ---            │
│ str            ┆ str            │
╞════════════════╪════════════════╡
│ john           ┆ JOHN           │
│   jane         ┆   JANE         │
│  alice         ┆  ALICE         │
│ bob            ┆ BOB            │
│ charlie        ┆ CHARLIE        │
│ eve            ┆ EVE            │
│ frank          ┆ FRANK          │
│ dan            ┆ DAN            │
└────────────────┴────────────────┘

### CONCAT

Concatenate strings

In [24]:
pl.sql(
    """
    SELECT
        CONCAT(FirstName, ' ', LastName) AS FullName
    FROM
        emp
    """
).collect()

shape: (8, 1)
┌─────────────────┐
│ FullName        │
│ ---             │
│ str             │
╞═════════════════╡
│ John Doe        │
│   Jane Smith    │
│  Alice  Johnson │
│ Bob Brown       │
│ Charlie Davis   │
│ Eve Wilson      │
│ Frank Taylor    │
│ Dan Smith       │
└─────────────────┘

### TRIM

Remove leading and trailing spaces

In [25]:
pl.sql(
    """
    SELECT
        FirstName,
        TRIM(FirstName) AS Trim,
        LTRIM(FirstName) AS LeadingTrim,
        RTRIM(FirstName) AS TrailingTrim
    FROM
        emp
    """
).collect()

shape: (8, 4)
┌───────────┬─────────┬─────────────┬──────────────┐
│ FirstName ┆ Trim    ┆ LeadingTrim ┆ TrailingTrim │
│ ---       ┆ ---     ┆ ---         ┆ ---          │
│ str       ┆ str     ┆ str         ┆ str          │
╞═══════════╪═════════╪═════════════╪══════════════╡
│ John      ┆ John    ┆ John        ┆ John         │
│   Jane    ┆ Jane    ┆ Jane        ┆   Jane       │
│  Alice    ┆ Alice   ┆ Alice       ┆  Alice       │
│ Bob       ┆ Bob     ┆ Bob         ┆ Bob          │
│ Charlie   ┆ Charlie ┆ Charlie     ┆ Charlie      │
│ Eve       ┆ Eve     ┆ Eve         ┆ Eve          │
│ Frank     ┆ Frank   ┆ Frank       ┆ Frank        │
│ Dan       ┆ Dan     ┆ Dan         ┆ Dan          │
└───────────┴─────────┴─────────────┴──────────────┘

## Date and Time Functions

### NOW/GETDATE

Get the current date and time

In [26]:
# pl.sql(
#     """
#     SELECT
#         GETDATE() AS CurrentDate
#     FROM
#         emp
#     """
# ).collect()

### DATETIME/DATE/YEAR/MONTH/DAY/TIME

Extract the date part of a datetime column

In [27]:
pl.sql(
    """
    SELECT
        DATETIME(HireDate) AS DateTime,
        DATE(HireDate) AS Date,
        -- YEAR(HireDate) AS Year,
        -- MONTH(HireDate) AS Year,
        -- DAY(HireDate) AS Year,
    FROM
        emp
    """
).collect()

shape: (8, 2)
┌─────────────────────┬────────────┐
│ DateTime            ┆ Date       │
│ ---                 ┆ ---        │
│ datetime[μs]        ┆ date       │
╞═════════════════════╪════════════╡
│ 2020-01-15 00:00:00 ┆ 2020-01-15 │
│ 2018-07-01 00:00:00 ┆ 2018-07-01 │
│ 2021-01-01 00:00:00 ┆ 2021-01-01 │
│ 2019-11-15 00:00:00 ┆ 2019-11-15 │
│ 2016-01-15 00:00:00 ┆ 2016-01-15 │
│ 2020-07-15 00:00:00 ┆ 2020-07-15 │
│ 2022-10-01 00:00:00 ┆ 2022-10-01 │
│ 2020-11-15 00:00:00 ┆ 2020-11-15 │
└─────────────────────┴────────────┘

### DATEDIFF

Calculates the difference between two dates

In [28]:
pl.sql(
    """
    SELECT
        DATE(ExitDate) - DATE(HireDate) AS EmploymentDuration
        -- DATEDIFF(date1, date2) AS EmploymentDurationDATEDIFF
    FROM
        emp
    """
).collect()

shape: (8, 1)
┌────────────────────┐
│ EmploymentDuration │
│ ---                │
│ duration[ms]       │
╞════════════════════╡
│ null               │
│ null               │
│ null               │
│ 1143d              │
│ null               │
│ null               │
│ null               │
│ null               │
└────────────────────┘

## CONDITIONAL LOGIC

### CASE

Add conditional logic to queries

In [29]:
pl.sql(
    """
    SELECT
        TRIM(FirstName) AS FirstName,
        ExitDate,
        CASE
            WHEN ExitDate IS NULL THEN 'False'
            ELSE 'True'
        END AS Expired
    FROM
        emp
    """
).collect()

shape: (8, 3)
┌───────────┬────────────┬─────────┐
│ FirstName ┆ ExitDate   ┆ Expired │
│ ---       ┆ ---        ┆ ---     │
│ str       ┆ str        ┆ str     │
╞═══════════╪════════════╪═════════╡
│ John      ┆ null       ┆ False   │
│ Jane      ┆ null       ┆ False   │
│ Alice     ┆ null       ┆ False   │
│ Bob       ┆ 2023-01-01 ┆ True    │
│ Charlie   ┆ null       ┆ False   │
│ Eve       ┆ null       ┆ False   │
│ Frank     ┆ null       ┆ False   │
│ Dan       ┆ null       ┆ False   │
└───────────┴────────────┴─────────┘

### IIF

Concise way to add conditional logic

In [30]:
# # Syntax: IIF(condition, true_value, false_value)

# pl.sql(
#     """
#     SELECT
#         TRIM(FirstName) AS FirstName,
#         ExitDate,
#         IIF(ExitDate IS NULL, 'False', 'True') AS Expired
#     FROM
#         emp
#     """
# ).collect()

## Miscellaneous

### DISTINCT

Select unique values

In [31]:
pl.sql(
    """
    SELECT
        DISTINCT(DepartmentID) AS DistinctDeptID
    FROM
        emp
    """
).collect()

shape: (4, 1)
┌────────────────┐
│ DistinctDeptID │
│ ---            │
│ i64            │
╞════════════════╡
│ 1              │
│ 2              │
│ 3              │
│ 5              │
└────────────────┘

### IS NULL/IS NOT NULL

Check for NULL values

In [32]:
pl.sql(
    """
    SELECT
        *
    FROM
        emp
    WHERE
        ExitDate IS NOT NULL
    """
).collect()

shape: (1, 10)
┌────────────┬───────────┬──────────┬─────────┬───┬────────────┬───────────┬───────────┬───────────┐
│ EmployeeID ┆ FirstName ┆ LastName ┆ Salary  ┆ … ┆ Department ┆ PhoneNumb ┆ Email     ┆ ManagerID │
│ ---        ┆ ---       ┆ ---      ┆ ---     ┆   ┆ ID         ┆ er        ┆ ---       ┆ ---       │
│ i64        ┆ str       ┆ str      ┆ f64     ┆   ┆ ---        ┆ ---       ┆ str       ┆ i64       │
│            ┆           ┆          ┆         ┆   ┆ i64        ┆ str       ┆           ┆           │
╞════════════╪═══════════╪══════════╪═════════╪═══╪════════════╪═══════════╪═══════════╪═══════════╡
│ 4          ┆ Bob       ┆ Brown    ┆ 45000.0 ┆ … ┆ 3          ┆ 987-456-7 ┆ bob.brown ┆ 2         │
│            ┆           ┆          ┆         ┆   ┆            ┆ 890       ┆ @example. ┆           │
│            ┆           ┆          ┆         ┆   ┆            ┆           ┆ com       ┆           │
└────────────┴───────────┴──────────┴─────────┴───┴────────────┴───────────┴───────────┴───────────┘

### COALESCE

Return the first non-NULL value

In [33]:
# Syntax: COALESCE(column1, column2, 'default_value')

pl.sql(
    """
    SELECT
        FirstName,
        LastName,
        COALESCE(Email, PhoneNumber, 'No Contact Info') AS ContactInfo
    FROM
        emp
    """
).collect()

shape: (8, 3)
┌───────────┬──────────┬───────────────────────────┐
│ FirstName ┆ LastName ┆ ContactInfo               │
│ ---       ┆ ---      ┆ ---                       │
│ str       ┆ str      ┆ str                       │
╞═══════════╪══════════╪═══════════════════════════╡
│ John      ┆ Doe      ┆ john.doe@example.com      │
│   Jane    ┆ Smith    ┆ jane.smith@example.com    │
│  Alice    ┆ Johnson  ┆ alice.johnson@example.com │
│ Bob       ┆ Brown    ┆ bob.brown@example.com     │
│ Charlie   ┆ Davis    ┆ charlie.davis@example.com │
│ Eve       ┆ Wilson   ┆ eve.wilson@example.com    │
│ Frank     ┆ Taylor   ┆ 945-456-7890              │
│ Dan       ┆ Smith    ┆ No Contact Info           │
└───────────┴──────────┴───────────────────────────┘

## Window Functions

### OVER

The OVER clause defines the window (a subset of rows) on which a window function operates. It can include:

- PARTITION BY: Divides rows into groups (like a GROUP BY but without collapsing rows)
- ORDER BY: Defines the order of rows within the window

In [34]:
# pl.sql(
#     """
#     SELECT
#         FirstName,
#         LastName,
#         DepartmentID,
#         RANK() OVER (PARTITION BY DepartmentID ORDER BY Salary DESC) AS InterDeptSalaryRank
#     FROM
#         emp
#     """
# ).collect()

### RANK

Assigns a rank to each row within a partition, with gaps if there are ties (If two rows tie for rank 1, the next rank will be 3 (e.g., 1, 1, 3, 4))

In [35]:
# pl.sql(
#     """
#     SELECT
#         FirstName,
#         LastName,
#         DepartmentID,
#         RANK() OVER (PARTITION BY DepartmentID ORDER BY Salary DESC) AS InterDeptSalaryRank
#     FROM
#         emp
#     """
# ).collect()

### DENSE_RANK

Similar to RANK, but without gaps in ranking for ties (If two rows tie for rank 1, the next rank will be 2 (e.g., 1, 1, 2, 3))

In [36]:
# pl.sql(
#     """
#     SELECT
#         FirstName,
#         LastName,
#         DepartmentID,
#         DENSE_RANK() OVER (PARTITION BY DepartmentID ORDER BY Salary DESC) AS InterDeptSalaryDenseRank
#     FROM
#         emp
#     """
# ).collect()

### LAG

Returns the value of a column from the **previous** row in the result set

In [37]:
# pl.sql(
#     """
#     SELECT
#         EntityID,
#         State AS CurrentState,
#         COALESCE(
#             LAG(State) OVER (PARTITION BY EntityID ORDER BY TransitionTime ASC),
#             'No previous State' -- if no previous state
#         ) AS PreviousState
#     FROM
#         emp
#     """
# ).collect()

### LEAD

Returns the value of a column from the **next** row in the result set

In [38]:
# pl.sql(
#     """
#     SELECT
#         EntityID,
#         State,
#         TransitionTime AS StateStartDate
#         COALESCE(
#             LEAD(TransitionTime) OVER (PARTITION BY EntityID ORDER BY TransitionTime ASC),
#             MAX(TransitionTime) OVER (PARTITION BY EntityID ORDER BY TransitionTime ASC) -- if last state StartDate = EndDate
#         ) AS StateEndDate
#     FROM
#         emp
#     """
# ).collect()

## Advanced Queries

### UNION/UNION ALL

Combine results from multiple queries

In [39]:
pl.sql(
    """
    (SELECT
        FirstName
    FROM
        emp
    WHERE
        FirstName = 'Dan')

    UNION

    (SELECT
        FirstName
    FROM
        emp
    WHERE
        FirstName = 'Eve')
    """
).collect()

shape: (2, 1)
┌───────────┐
│ FirstName │
│ ---       │
│ str       │
╞═══════════╡
│ Dan       │
│ Eve       │
└───────────┘

### SUBQUERIES

In [40]:
# pl.sql(
#     """
#     SELECT
#         FirstName,
#         Salary
#     FROM
#         emp
#     WHERE
#         Salary = (SELECT MAX(Salary) FROM emp)
#     """
# ).collect()

### COMMON TABLE EXPRESSION

A temporary, named result set in SQL that is defined within a query and exists only for the duration of that query. It simplifies complex queries by breaking them into smaller, logical parts and improves readability and maintainability.

In [41]:
# pl.sql(
#     """
#     -- CTE definition
#     WITH CommonTableExpression AS (
#         SELECT
#             DepartmentID,
#             AVG(Salary) AS DeptAvgSalary
#         FROM
#             emp
#         GROUP BY
#             DepartmentID
#     )

#     -- SELECT query
#     SELECT
#         e.FirstName,
#         e.LastName,
#         e.Salary,
#         e.DepartmentID,
#         cte.DeptAvgSalary
#     FROM
#         emp e
#     INNER JOIN
#         CommonTableExpression cte ON cte.DepartmentID = e.DepartmentID
#     WHERE
#         e.Salary > cte.DeptAvgSalary
#     """
# ).collect()